Revit 2027 API
RibbonPanel.AddStackedItems(RibbonItemData, RibbonItemData) Method
 Adds two stacked items to the panel.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<RibbonItem> AddStackedItems(
	RibbonItemData item1,
	RibbonItemData item2
)
Public Function AddStackedItems (
	item1 As RibbonItemData,
	item2 As RibbonItemData
) As IList(Of RibbonItem)
public:
IList<RibbonItem^>^ AddStackedItems(
	RibbonItemData^ item1,
	RibbonItemData^ item2
)
member AddStackedItems :
        item1 : RibbonItemData *
        item2 : RibbonItemData -> IList<RibbonItem>
Parameters
item1 RibbonItemData
 Data containing information about the first item. This data must be of type PushButtonData, PulldownButtonData, SplitButtonData, ComboBoxData, or TextBoxData.
item2 RibbonItemData
 Data containing information about the second item. This data must be of type PushButtonData, PulldownButtonData, SplitButtonData, ComboBoxData, or TextBoxData.
Return Value
IList<RibbonItem>
 A collection containing the added items.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when item1 or item2 is null.
ArgumentException | Thrown when an item with the item1.Name or item2.Name already exists in the panel or the data is not of the correct type.
Remarks
 Each new item may either be a PushButton, PulldownButton, SplitButton, ComboBox or TextBox, depending upon the type of data passed in for each argument. The new items will be created as small-size horizontal controls, with the first stacked on top of the second in the panel.
See Also
Reference
RibbonPanel Class
AddStackedItems Overload
Autodesk.Revit.UI Namespace